william_ding/week05/wednesday/football_app_v2/app/views/teams/_form.html.erb

  <%= f.label :country_id %>
  <%= f.select :country_id, Country.pluck(:name, :id) %>
---
SELECT "countries"."name", "countries"."id" FROM "countries"