william_ding/week05/wednesday/football_app_v2/app/controllers/teams_controller.rb

  def index
    @teams = Team.all.order(:created_at)
---
SELECT "teams".* FROM "teams" ORDER BY "teams"."created_at" ASC

  def show
    @team = Team.find params[:id]
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def edit
    @team = Team.find params[:id]
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    team = Team.find params[:id]
    team.update strong_params
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "teams" SET "image" = $1, "updated_at" = $2 WHERE "teams"."id" = $3  [["image", "http://fillmurray.com/100/99"], ["updated_at", "2019-01-16 11:25:28.230592"], ["id", 6]]

  def create
    team = Team.create strong_params
---
INSERT INTO "teams" ("name", "city", "stadium", "title", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    team = Team.find params[:id]
    team.destroy
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = $1  [["id", 11]]