william_ding/week05/wednesday/football_app_v2/app/views/players/show.html.erb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
<p>Nation: <%= @player.nation %></p>
<p>Team: <%= @player.team.name if @player.team_id.present? %></p>